# St7GetSolverLoadCaseCablePreLoad

Returns the load case that specifies the pre-loads applied to cable elements.

long St7GetSolverLoadCaseCablePreLoad(long uID, long* CaseNum)

Input Parameters

uID

Strand7 model file ID.

Output Parameters

CaseNum

Load case number.

Strand7 API Manual

Applicability

Applicable to linear transient dynamic analysis.